g17 = ["Полина", "Кристина", "Полина", "Полина", "Виолетта", "Виолетта", "Анна", "Виктория", "Алиса", "Алиса"]
g18 = ["Кристина", "Полина", "Полина","Полина", "Кристина", "Полина", "Акакий"]
g19 = ["Виолетта", "Виолетта", "Анна", "Виктория", "Алиса", "Алиса", "Виолетта", "Виолетта", "Анна", "Виктория", "Алиса", "Алиса", "Виолетта", "Виолетта", "Анна", "Виктория", "Алиса", "Алиса"]
print("Общее кол-во студентов: ", len(g17) + len(g18) + len(g19))
g1 = len(g17)
g2 = len(g18)
g3 = len(g19)
print("Самая многочисленная: ", end = '')
if g1 > g2:
    if g1 > g3:
        print("17")
    else:
        print("19")
else:
    if g2 > g3:
        print("18")
    else:
        print("19")

print("Самая малочисленная: ", end = '')
if g1 < g2:
    if g1 < g3:
        print("17")
    else:
        print("19")
else:
    if g2 < g3:
        print("18")
    else:
        print("19")
print("Группа 17: ",sorted(g17))
print("Группа 18: ",sorted(g18))
print("Группа 19: ",sorted(g19))
